Documents/ЗачетОплатыАренды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>ЗачетОплатыАренды</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.Финансовый</xr:Item>
				<xr:Item>AccumulationRegister.ВзаиморасчетыПоДоговорамАренды</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>Организация-арендодатель</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТорговаяТочка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ) Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЗачетДепозита</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТипАренднойПлаты</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыАренднойПлаты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПериодРегистрации</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаВВалютеДепозита</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФормаОплаты</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ФормыОплаты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ЗачетОплатыАренды/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если Дата > ТекущаяДата() Тогда
		РежимПроведения = РежимПроведенияДокумента.Неоперативный;
	КонецЕсли;
	
	Движения.Финансовый.Очистить();
	Движения.Финансовый.Записывать = Истина;
	
	Для Каждого Строка Из ЗачетДепозита Цикл
		
		Проводка = Движения.Финансовый.Добавить();
		Проводка.Период = Дата;
		Проводка.СчетДт = ПланыСчетов.Финансовый.РасчетыПоАренде;
		БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Организации", Организация);
		БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Контрагенты", Контрагент);
		БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "ТорговыеТочки", ТорговаяТочка);
		Проводка.СчетКт = ПланыСчетов.Финансовый.ОбеспечительныйВзнос;
		БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Организации", Организация);
		БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Контрагенты", Контрагент);
		БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "ТорговыеТочки", ТорговаяТочка);
		Проводка.Содержание = "Зачет оплаты аренда в счет депозита за период с " + Формат(НачалоМесяца(Строка.ПериодРегистрации), "ДФ=dd.MM.yyyy") + " по " + Формат(КонецМесяца(Строка.ПериодРегистрации), "ДФ=dd.MM.yyyy");
		Проводка.Сумма = Строка.Сумма;

	КонецЦикла;

	АК_УчетМСФО.ЗаполнитьОрганизацию(Движения.Финансовый,Организация);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если (НЕ ЭтотОбъект.ДоговорКонтрагента = ЭтотОбъект.Ссылка.ДоговорКонтрагента)
			И ДопМодульСервер.НекорректныйДоговор(ЭтотОбъект.ДоговорКонтрагента) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Указан некорректный договор (помечен на удаление либо не используется)");
		Отказ = Истина;
	КонецЕсли;
		
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		ТаблицаДепозитов = ЭтотОбъект.ЗачетДепозита.Выгрузить();
		ТаблицаДепозитов.Свернуть("ТипАренднойПлаты, ПериодРегистрации", "Сумма");
		
		Для Каждого СтрокаТаблицы Из ТаблицаДепозитов Цикл
			ПроцедурыНачисления.ПроверитьЛимитыПоАрендеЗаявкиИОплаты(ЭтотОбъект.Ссылка, , СтрокаТаблицы.Сумма, ЭтотОбъект.ТорговаяТочка,
																		СтрокаТаблицы.ТипАренднойПлаты, СтрокаТаблицы.ПериодРегистрации, Отказ);
		КонецЦикла;  
	КонецЕсли; 
	
КонецПроцедуры
